/*3. Напишите программу с классом, у которого есть два целочисленных поля.
В классе должны быть описаны конструкторы, позволяющие создавать
объекты без передачи аргументов, с передачей одного аргумента и с передачей
двух аргументов*/
package lr5.example3;

public class Test {
    int x; //поле класса
    int y; // поле класса

    public Test (){ // конструктор без аргументов
    }

    public Test (int x){ //конструктор с 1 аргументом
    }

    public Test (int x , int y){ //конструктор с 2 аргументами
    }
}
